docs/api/cfd/cases/flat_plate_blasius/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Laminar flat-plate boundary layer — Blasius verification (digitalmodel #1192) |
|  Two-block: 20 mm upstream SYMMETRY run-in, then a 100 mm no-slip plate, so   |
|  the leading edge sees a clean uniform stream (no inlet/LE singularity).      |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

convertToMeters 1;

// H = 0.10 m freestream height (20x BL thickness at the trailing edge).
vertices
(
    (-0.02  0     0      )   // 0
    ( 0     0     0      )   // 1
    ( 0.1   0     0      )   // 2
    ( 0.1   0.10  0      )   // 3
    ( 0     0.10  0      )   // 4
    (-0.02  0.10  0      )   // 5
    (-0.02  0     0.001  )   // 6
    ( 0     0     0.001  )   // 7
    ( 0.1   0     0.001  )   // 8
    ( 0.1   0.10  0.001  )   // 9
    ( 0     0.10  0.001  )   // 10
    (-0.02  0.10  0.001  )   // 11
);

blocks
(
    // upstream run-in: 40 x 110 cells, wall-clustered in y
    hex (0 1 4 5 6 7 10 11) (40 110 1)  simpleGrading (1 800 1)
    // plate: 220 x 110 cells
    hex (1 2 3 4 7 8 9 10) (220 110 1)  simpleGrading (1 800 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ( (0 6 11 5) );
    }
    outlet
    {
        type patch;
        faces ( (2 3 9 8) );
    }
    symmetry
    {
        type symmetryPlane;
        faces ( (0 1 7 6) );
    }
    plate
    {
        type wall;
        faces ( (1 2 8 7) );
    }
    top
    {
        type patch;
        faces ( (5 11 10 4) (4 10 9 3) );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 5) (1 2 3 4)
            (6 7 10 11) (7 8 9 10)
        );
    }
);

mergePatchPairs ();
