docs/api/cfd/cases/flat_plate_blasius/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }

simulationType  laminar;
