docs/api/cfd/cases/flat_plate_blasius/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);

boundaryField
{
    inlet    { type fixedValue; value uniform (1 0 0); }
    outlet   { type inletOutlet; inletValue uniform (0 0 0); value uniform (1 0 0); }
    symmetry { type symmetryPlane; }
    plate    { type noSlip; }
    // Entraining freestream: lets the boundary layer draw fluid down through the
    // top instead of accelerating it horizontally (which a slip wall would force,
    // creating a spurious favourable pressure gradient).
    top      { type pressureInletOutletVelocity; value uniform (1 0 0); }
    frontAndBack { type empty; }
}
